In [2]:
import numpy as np
import pandas as pd

In [3]:
TX=pd.read_csv('/Users/andrei/Documents/Maestria_MNA/Trimestre_6/Pruebas_de_Software/Semana4/Ejercicio_Programacion1/P2/TC1.txt')

In [4]:
TC2=pd.read_csv('/Users/andrei/Documents/Maestria_MNA/Trimestre_6/Pruebas_de_Software/Semana4/Ejercicio_Programacion1/P2/TC2.txt')

In [5]:
TC3=pd.read_csv('/Users/andrei/Documents/Maestria_MNA/Trimestre_6/Pruebas_de_Software/Semana4/Ejercicio_Programacion1/P2/TC3.txt')

In [6]:
TC4=pd.read_csv('/Users/andrei/Documents/Maestria_MNA/Trimestre_6/Pruebas_de_Software/Semana4/Ejercicio_Programacion1/P2/TC4.txt')

In [7]:
TX.columns = ['TC1']
TC2.columns = ['TC2']
TC3.columns = ['TC3']
TC4.columns = ['TC4']

In [8]:
TX

         TC1
0    5517055
1    1336159
2    6750185
3    1771937
4     360952
..       ...
194  4555717
195  3526753
196  3176815
197   858440
198  2250854

[199 rows x 1 columns]

In [9]:
TX.loc[0] = ["6980368"]
TC2.loc[0] = ["7116776"]
TC3.loc[0] = ["-39"]
TC4.loc[0] = ["-39"]

In [10]:
TX['TC1'], TC2['TC2'], TC3['TC3'], TC4['TC4']

(0      6980368
 1      1336159
 2      6750185
 3      1771937
 4       360952
         ...
 194    4555717
 195    3526753
 196    3176815
 197     858440
 198    2250854
 Name: TC1, Length: 199, dtype: object,
 0      7116776
 1      8886983
 2       839365
 3       924280
 4      1026310
         ...
 194    6735760
 195    8895858
 196    4238091
 197    7093069
 198         39
 Name: TC2, Length: 199, dtype: object,
 0      -39
 1        8
 2       34
 3       17
 4       49
       ...
 194    -25
 195    -33
 196     16
 197     17
 198      4
 Name: TC3, Length: 199, dtype: object,
 0     -39
 1       8
 2      34
 3      17
 4      49
 5       5
 6     ABC
 7       0
 8      33
 9      12
 10     -6
 11     27
 12     -4
 13    -38
 14     26
 15     49
 16     29
 17     42
 18    -16
 19    ERR
 20     34
 21     20
 22      0
 23     25
 24     45
 25      3
 26    -46
 27    -46
 28     29
 29     33
 30     29
 31     26
 32     -5
 33    -36
 34     12
 35     45
 36    -50
 37      0
 38     -6
 39    VAL
 Name: TC4, dtype: object)

In [11]:
TC1Hex = TX['TC1']
TC2Hex = TC2['TC2']
TC3Hex = TC3['TC3']
TC4Hex = TC4['TC4']

In [12]:
def binary(n):
    s = bin(n & int("1"*24, 2))[2:]
    return ("{0:0>%s}" % (24)).format(s)

In [13]:
TX = TX.dropna()

In [14]:
TX['TC1'] = TX['TC1'].astype(int)
TX['TC1'].dtype
TX['TC1'] = TX.apply(lambda x: binary(x[0]), axis=1)
TX

                          TC1
0    011010101000001100010000
1    000101000110001101011111
2    011001101111111111101001
3    000110110000100110100001
4    000001011000000111111000
..                        ...
194  010001011000001111000101
195  001101011101000001100001
196  001100000111100101101111
197  000011010001100101001000
198  001000100101100001100110

[199 rows x 1 columns]

In [15]:
TC2['TC2'] = TC2['TC2'].astype(int)

In [16]:
TC2['TC2'].dtype

dtype('int64')

In [17]:
TC2['TC2']= TC2.apply(lambda x: binary(x[0]), axis=1)

In [18]:
TC2

                          TC2
0    011011001001011111101000
1    100001111001101011000111
2    000011001100111011000101
3    000011100001101001111000
4    000011111010100100000110
..                        ...
194  011001101100011110010000
195  100001111011110101110010
196  010000001010101100001011
197  011011000011101101001101
198  000000000000000000100111

[199 rows x 1 columns]

In [19]:
TC3['TC3'] = TC3['TC3'].astype(int)
TC3['TC3'].dtype
TC3['TC3']= TC3.apply(lambda x: binary(x[0]), axis=1)
TC3

                          TC3
0    111111111111111111011001
1    000000000000000000001000
2    000000000000000000100010
3    000000000000000000010001
4    000000000000000000110001
..                        ...
194  111111111111111111100111
195  111111111111111111011111
196  000000000000000000010000
197  000000000000000000010001
198  000000000000000000000100

[199 rows x 1 columns]

In [20]:
TC4['TC4']= pd.to_numeric(TC4['TC4'],errors = 'coerce')
TC4 = TC4.dropna()

In [21]:
TC4['TC4'].dtype

dtype('float64')

In [22]:
TC4['TC4'] = TC4['TC4'].astype(int)

In [23]:
TC4['TC4']= TC4.apply(lambda x: binary(x[0]), axis=1)

In [24]:
TC4

                         TC4
0   111111111111111111011001
1   000000000000000000001000
2   000000000000000000100010
3   000000000000000000010001
4   000000000000000000110001
5   000000000000000000000101
7   000000000000000000000000
8   000000000000000000100001
9   000000000000000000001100
10  111111111111111111111010
11  000000000000000000011011
12  111111111111111111111100
13  111111111111111111011010
14  000000000000000000011010
15  000000000000000000110001
16  000000000000000000011101
17  000000000000000000101010
18  111111111111111111110000
20  000000000000000000100010
21  000000000000000000010100
22  000000000000000000000000
23  000000000000000000011001
24  000000000000000000101101
25  000000000000000000000011
26  111111111111111111010010
27  111111111111111111010010
28  000000000000000000011101
29  000000000000000000100001
30  000000000000000000011101
31  000000000000000000011010
32  111111111111111111111011
33  111111111111111111011100
34  000000000000000000001100
35  000000000000000000101101
36  111111111111111111001110
37  000000000000000000000000
38  111111111111111111111010

In [25]:
BinaryNum = pd.concat([TX, TC2, TC3, TC4], axis=1)

In [26]:
print(BinaryNum)

                          TC1                       TC2  \
0    011010101000001100010000  011011001001011111101000
1    000101000110001101011111  100001111001101011000111
2    011001101111111111101001  000011001100111011000101
3    000110110000100110100001  000011100001101001111000
4    000001011000000111111000  000011111010100100000110
..                        ...                       ...
194  010001011000001111000101  011001101100011110010000
195  001101011101000001100001  100001111011110101110010
196  001100000111100101101111  010000001010101100001011
197  000011010001100101001000  011011000011101101001101
198  001000100101100001100110  000000000000000000100111

                          TC3                       TC4
0    111111111111111111011001  111111111111111111011001
1    000000000000000000001000  000000000000000000001000
2    000000000000000000100010  000000000000000000100010
3    000000000000000000010001  000000000000000000010001
4    000000000000000000110001  000000000000000000110001
..                        ...                       ...
194  111111111111111111100111                       NaN
195  111111111111111111011111                       NaN
196  000000000000000000010000                       NaN
197  000000000000000000010001                       NaN
198  000000000000000000000100                       NaN

[199 rows x 4 columns]

In [27]:
TC1Hex

0      6980368
1      1336159
2      6750185
3      1771937
4       360952
        ...
194    4555717
195    3526753
196    3176815
197     858440
198    2250854
Name: TC1, Length: 199, dtype: object

In [28]:
TC1Hex = TC1Hex.astype(int)
TC1Hex = TC1Hex.apply( hex )

In [29]:
TC1Hex

0      0x6a8310
1      0x14635f
2      0x66ffe9
3      0x1b09a1
4       0x581f8
         ...
194    0x4583c5
195    0x35d061
196    0x30796f
197     0xd1948
198    0x225866
Name: TC1, Length: 199, dtype: object

In [30]:
TC2Hex = TC2Hex.astype(int)
TC2Hex = TC2Hex.apply( hex )

In [31]:
TC2Hex

0      0x6c97e8
1      0x879ac7
2       0xccec5
3       0xe1a78
4       0xfa906
         ...
194    0x66c790
195    0x87bd72
196    0x40ab0b
197    0x6c3b4d
198        0x27
Name: TC2, Length: 199, dtype: object

In [32]:
TC3Hex = TC3Hex.astype(int)
TC3Hex = TC3Hex.apply( hex )

In [33]:
TC3Hex

0      -0x27
1        0x8
2       0x22
3       0x11
4       0x31
       ...
194    -0x19
195    -0x21
196     0x10
197     0x11
198      0x4
Name: TC3, Length: 199, dtype: object

In [34]:
TC4Hex = pd.to_numeric(TC4Hex,errors = 'coerce')
TC4Hex = TC4Hex.dropna()

In [35]:
TC4Hex = TC4Hex.astype(int)
TC4Hex = TC4Hex.apply( hex )

In [36]:
TC4Hex

0     -0x27
1       0x8
2      0x22
3      0x11
4      0x31
5       0x5
7       0x0
8      0x21
9       0xc
10     -0x6
11     0x1b
12     -0x4
13    -0x26
14     0x1a
15     0x31
16     0x1d
17     0x2a
18    -0x10
20     0x22
21     0x14
22      0x0
23     0x19
24     0x2d
25      0x3
26    -0x2e
27    -0x2e
28     0x1d
29     0x21
30     0x1d
31     0x1a
32     -0x5
33    -0x24
34      0xc
35     0x2d
36    -0x32
37      0x0
38     -0x6
Name: TC4, dtype: object

In [37]:
HexadecimalNum = pd.concat([TC1Hex, TC2Hex, TC3Hex, TC4Hex], axis=1)

In [38]:
print(HexadecimalNum)

          TC1       TC2    TC3    TC4
0    0x6a8310  0x6c97e8  -0x27  -0x27
1    0x14635f  0x879ac7    0x8    0x8
2    0x66ffe9   0xccec5   0x22   0x22
3    0x1b09a1   0xe1a78   0x11   0x11
4     0x581f8   0xfa906   0x31   0x31
..        ...       ...    ...    ...
194  0x4583c5  0x66c790  -0x19    NaN
195  0x35d061  0x87bd72  -0x21    NaN
196  0x30796f  0x40ab0b   0x10    NaN
197   0xd1948  0x6c3b4d   0x11    NaN
198  0x225866      0x27    0x4    NaN

[199 rows x 4 columns]

In [39]:
Results = pd.concat([BinaryNum, HexadecimalNum], axis=1)

In [40]:
Results.columns = ['BinaryTC1', 'BinaryTC2', 'BinaryTC3', 'BinaryTC4', 'HexTC1', 'HexTC2','HexTC3','HexTC4']

In [41]:
Results

,BinaryTC1,BinaryTC2,BinaryTC3,BinaryTC4,HexTC1,HexTC2,HexTC3,HexTC4
0,011010101000001100010000,011011001001011111101000,111111111111111111011001,111111111111111111011001,0x6a8310,0x6c97e8,-0x27,-0x27
1,000101000110001101011111,100001111001101011000111,000000000000000000001000,000000000000000000001000,0x14635f,0x879ac7,0x8,0x8
2,011001101111111111101001,000011001100111011000101,000000000000000000100010,000000000000000000100010,0x66ffe9,0xccec5,0x22,0x22
3,000110110000100110100001,000011100001101001111000,000000000000000000010001,000000000000000000010001,0x1b09a1,0xe1a78,0x11,0x11
4,000001011000000111111000,000011111010100100000110,000000000000000000110001,000000000000000000110001,0x581f8,0xfa906,0x31,0x31
...,...,...,...,...,...,...,...,...
194,010001011000001111000101,011001101100011110010000,111111111111111111100111,NaN,0x4583c5,0x66c790,-0x19,NaN
195,001101011101000001100001,100001111011110101110010,111111111111111111011111,NaN,0x35d061,0x87bd72,-0x21,NaN
196,001100000111100101101111,010000001010101100001011,000000000000000000010000,NaN,0x30796f,0x40ab0b,0x10,NaN
197,000011010001100101001000,011011000011101101001101,000000000000000000010001,NaN,0xd1948,0x6c3b4d,0x11,NaN
198,001000100101100001100110,000000000000000000100111,000000000000000000000100,NaN,0x225866,0x27,0x4,NaN

In [42]:
Results.to_csv('fileWithData.txt', sep='\t', index=False)